AustinJ755/FH17EBikeSoftware/Austin_Test_Space/ebike.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --board "/LAUNCHXL_F280049C" --context "system" --product "C2000WARE@4.02.00.00"
 * @versions {"tool":"1.14.0+2667"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc              = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1             = adc.addInstance();
const adc2             = adc.addInstance();
const adc3             = adc.addInstance();
const aio              = scripting.addModule("/driverlib/aio.js", {}, false);
const aio1             = aio.addInstance();
const aio2             = aio.addInstance();
const aio3             = aio.addInstance();
const aio4             = aio.addInstance();
const aio5             = aio.addInstance();
const aio6             = aio.addInstance();
const asysctl          = scripting.addModule("/driverlib/asysctl.js");
const cputimer         = scripting.addModule("/driverlib/cputimer.js", {}, false);
const cputimer1        = cputimer.addInstance();
const cputimer2        = cputimer.addInstance();
const ecap             = scripting.addModule("/driverlib/ecap.js", {}, false);
const ecap1            = ecap.addInstance();
const ecap2            = ecap.addInstance();
const ecap3            = ecap.addInstance();
const epwm             = scripting.addModule("/driverlib/epwm.js");
const epwm1            = epwm.addInstance();
const epwm2            = epwm.addInstance();
const epwm3            = epwm.addInstance();
const gpio             = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1            = gpio.addInstance();
const gpio2            = gpio.addInstance();
const gpio3            = gpio.addInstance();
const gpio4            = gpio.addInstance();
const gpio5            = gpio.addInstance();
const gpio6            = gpio.addInstance();
const gpio7            = gpio.addInstance();
const gpio8            = gpio.addInstance();
const gpio9            = gpio.addInstance();
const gpio10           = gpio.addInstance();
const gpio11           = gpio.addInstance();
const gpio12           = gpio.addInstance();
const gpio13           = gpio.addInstance();
const gpio14           = gpio.addInstance();
const inputxbar_input  = scripting.addModule("/driverlib/inputxbar_input.js", {}, false);
const inputxbar_input1 = inputxbar_input.addInstance();
const inputxbar_input2 = inputxbar_input.addInstance();
const inputxbar_input3 = inputxbar_input.addInstance();
const inputxbar_input4 = inputxbar_input.addInstance();
const inputxbar_input5 = inputxbar_input.addInstance();
const inputxbar_input6 = inputxbar_input.addInstance();
const inputxbar_input7 = inputxbar_input.addInstance();
const sci              = scripting.addModule("/driverlib/sci.js", {}, false);
const sci1             = sci.addInstance();
const sci2             = sci.addInstance();
const spi              = scripting.addModule("/driverlib/spi.js", {}, false);
const spi1             = spi.addInstance();
const spi2             = spi.addInstance();
const sync             = scripting.addModule("/driverlib/sync.js");
const sysctl           = scripting.addModule("/driverlib/sysctl.js");

/**
 * Write custom configuration values to the imported modules.
 */
adc1.socHighPriorityMode         = "ADC_PRI_SOC0_HIPRI";
adc1.soc0Trigger                 = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc1Channel                 = "ADC_CH_ADCIN1";
adc1.$name                       = "ADC_A";
adc1.soc0Name                    = "PHASE_U_CURR_SAMPLE";
adc1.soc1Name                    = "THROTTLE_SAMPLE";
adc1.interruptPulseMode          = "ADC_PULSE_END_OF_CONV";
adc1.enabledInts                 = ["ADC_INT_NUMBER1"];
adc1.enableInterrupt1            = true;
adc1.registerInterrupts          = ["1"];
adc1.soc0UseSampleTimeCalculator = true;
adc1.soc0InputCapacitance        = 5;
adc1.soc0InputResistance         = 100;
adc1.soc0SampleWindow            = 4;
adc1.soc1SampleWindow            = 50;
adc1.enabledSOCs                 = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc1.soc1Trigger                 = "ADC_TRIGGER_EPWM1_SOCA";
adc1.adcInt1.enableInterrupt     = true;
adc1.adcInt1.interruptHandler    = "pwmCountTrigger";

adc2.adcBase              = "ADCB_BASE";
adc2.$name                = "ADC_B";
adc2.socHighPriorityMode  = "ADC_PRI_SOC0_HIPRI";
adc2.enabledSOCs          = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc2.soc0Name             = "PHASE_CUR_SAMPLE";
adc2.soc0Trigger          = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc1Name             = "BATTERY_VOLTAGE_SAMPLE";
adc2.soc1Channel          = "ADC_CH_ADCIN1";
adc2.useInterrupts        = false;
adc2.soc0SampleWindow     = 4;
adc2.soc1InterruptTrigger = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc2.soc1SampleWindow     = 50;

adc3.adcBase              = "ADCC_BASE";
adc3.$name                = "ADC_C";
adc3.socHighPriorityMode  = "ADC_PRI_SOC0_HIPRI";
adc3.enabledSOCs          = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc3.soc0Name             = "PHASE_W_CURR_SAMPLE";
adc3.soc0Trigger          = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc1Name             = "MOTOR_CONTROL_TEMP_SENSE";
adc3.soc1Channel          = "ADC_CH_ADCIN1";
adc3.useInterrupts        = false;
adc3.soc0SampleWindow     = 4;
adc3.soc1InterruptTrigger = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc3.soc1SampleWindow     = 50;

aio1.$name                  = "PHASE_U_CURRENT_SENSOR";
aio1.aioPin["AIO#"].$assign = "boosterpack2.70";

aio2.$name                  = "PHASE_V_CURRENT_SENSOR";
aio2.aioPin["AIO#"].$assign = "boosterpack1.24";

aio3.$name                  = "PHASE_W_CURRENT_SENSOR";
aio3.aioPin["AIO#"].$assign = "boosterpack1.28";

aio4.$name                  = "THROTTLE_ADC_SENSOR";
aio4.aioPin["AIO#"].$assign = "boosterpack1.30";

aio5.$name                  = "BATTERY_VOLTAGE_SENSOR";
aio5.aioPin["AIO#"].$assign = "boosterpack1.26";

aio6.$name                  = "MOTOR_CONTROLLER_TEMP_SENSOR";
aio6.aioPin["AIO#"].$assign = "boosterpack2.66";

asysctl.analogReference        = "INTERNAL";
asysctl.analogReferenceVoltage = "1P65";

