AustinJ755/FH17EBikeSoftware/Austin_Test_Space/ebike.syscfg
gpio5.$name = "GPIO_BUTTON_3_GPIO";

gpio6.$name           = "GPIO_BUTTON_4_GPIO";
gpio6.gpioPin.$assign = "boosterpack2.73";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EQEP2 Header on the LaunchPad F280049C\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", gpio6, "gpioPin");

gpio7.$name           = "ESTOP_BUTTON_GPIO";
gpio7.gpioPin.$assign = "boosterpack2.72";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EQEP2 Header on the LaunchPad F280049C\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", gpio7, "gpioPin");

gpio8.$name                      = "HALL_EFFECT_U_GPIO";
gpio8.useInterrupt               = true;
gpio8.qualMode                   = "GPIO_QUAL_6SAMPLE";
gpio8.gpioPin.$assign            = "boosterpack1.10";
gpio8.xint.enableInt             = true;
gpio8.xint.registerInterrupts    = true;
gpio8.xint.xInt.enableInterrupt  = true;
gpio8.xint.xInt.interruptHandler = "logTime";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EQEP1 Header on the LaunchPad F280049C\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", gpio8, "gpioPin");

gpio9.$name                      = "HALL_EFFECT_V_GPIO";
gpio9.useInterrupt               = true;
gpio9.qualMode                   = "GPIO_QUAL_6SAMPLE";
gpio9.gpioPin.$assign            = "boosterpack1.9";
gpio9.xint.xintNum               = "GPIO_INT_XINT2";
gpio9.xint.intType               = "GPIO_INT_TYPE_BOTH_EDGES";
gpio9.xint.enableInt             = true;
gpio9.xint.registerInterrupts    = true;
gpio9.xint.xInt.enableInterrupt  = true;
gpio9.xint.xInt.interruptHandler = "logTime1";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EQEP1 Header on the LaunchPad F280049C\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", gpio9, "gpioPin");

gpio10.$name                      = "HALL_EFFECT_W_GPIO";
gpio10.useInterrupt               = true;
gpio10.qualMode                   = "GPIO_QUAL_6SAMPLE";
gpio10.gpioPin.$assign            = "boosterpack1.11";
gpio10.xint.intType               = "GPIO_INT_TYPE_BOTH_EDGES";
gpio10.xint.enableInt             = true;
gpio10.xint.registerInterrupts    = true;
gpio10.xint.xintNum               = "GPIO_INT_XINT3";
gpio10.xint.xInt.enableInterrupt  = true;
gpio10.xint.xInt.interruptHandler = "logTime2";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EQEP1 Header on the LaunchPad F280049C\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", gpio10, "gpioPin");

gpio11.$name           = "PEDAL_ASSIST_SENSOR";
gpio11.gpioPin.$assign = "boosterpack2.74";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EQEP2 Header on the LaunchPad F280049C\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", gpio11, "gpioPin");

gpio12.$name           = "MOTOR_CONTROL_FAULT_PIN";
gpio12.gpioPin.$assign = "boosterpack2.51";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to FSI Header on the LaunchPad F280049C\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", gpio12, "gpioPin");

gpio13.$name             = "ILI9341_GPIO_RESET_PIN";
gpio13.direction         = "GPIO_DIR_MODE_OUT";
gpio13.writeInitialValue = true;
gpio13.initialValue      = 1;
gpio13.gpioPin.$assign   = "boosterpack1.40";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EPWM6 BP on the LaunchPad F280049C\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", gpio13, "gpioPin");

gpio14.$name           = "MotorEnableINV";
gpio14.padConfig       = "PULLUP";
gpio14.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio14.gpioPin.$assign = "boosterpack1.38";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EPWM5 BP on the LaunchPad F280049C\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", gpio14, "gpioPin");

inputxbar_input1.inputxbarGpio = "GPIO35";
inputxbar_input1.$name         = "PhaseUHall";

inputxbar_input2.inputxbarInput = "XBAR_INPUT2";
inputxbar_input2.inputxbarGpio  = "GPIO37";
inputxbar_input2.$name          = "PhaseVHall";

inputxbar_input3.inputxbarInput = "XBAR_INPUT3";
inputxbar_input3.inputxbarGpio  = "GPIO59";
inputxbar_input3.$name          = "PhaseWHall";

inputxbar_input4.$name         = "myINPUTXBARINPUT0";
gpio8.xint.inputxbar           = inputxbar_input4;
inputxbar_input4.inputxbarGpio = "GPIO35";

inputxbar_input5.$name         = "myINPUTXBARINPUT1";
gpio9.xint.inputxbar           = inputxbar_input5;
inputxbar_input5.inputxbarGpio = "GPIO37";

inputxbar_input6.$name         = "myINPUTXBARINPUT2";
gpio10.xint.inputxbar          = inputxbar_input6;
inputxbar_input6.inputxbarGpio = "GPIO59";

inputxbar_input7.$name          = "myINPUTXBARINPUT3";
inputxbar_input7.inputxbarInput = "XBAR_INPUT13";
inputxbar_input7.inputxbarGpio  = "GPIO58";

sci1.$hardware             = system.deviceData.board.components.XDS_UART.subComponents.XDS_SCI_INST1;
sci1.enabledFIFOInterrupts = ["SCI_INT_RXFF"];
sci1.rxFifo                = "SCI_FIFO_RX1";
sci1.$name                 = "DATA_LOG_UART";

sci2.$name     = "GPS_COM_UART";
sci2.$hardware = system.deviceData.board.components.BP_SITE_1.subComponents.SCI;

spi1.$name                           = "Ili9341_SPI";
spi1.emulationMode                   = "SPI_EMULATION_STOP_AFTER_TRANSMIT";
spi1.useDMATX                        = true;
spi1.mode                            = "SPI_MODE_MASTER";
spi1.$hardware                       = system.deviceData.board.components.BP_SITE_1.subComponents.SPI;
spi1.rxFifo                          = "SPI_FIFO_RX8";
spi1.transferProtocol                = "SPI_PROT_POL0PHA1";
spi1.enabledFIFOInterrupts           = ["SPI_INT_RXFF","SPI_INT_TXFF"];
spi1.txFifo                          = "SPI_FIFO_TX0";
spi1.bitRate                         = 25000000;
spi1.spiTXDMA.databusWidthConfig     = scripting.forceWrite("DMA_CFG_SIZE_16BIT");
spi1.spiTXDMA.enableTriggers         = true;
spi1.spiTXDMA.useInterrupts          = true;
spi1.spiTXDMA.registerInterrupts     = true;
spi1.spiTXDMA.enableInterrupts       = true;
spi1.spiTXDMA.interruptMode          = "DMA_INT_AT_END";
spi1.spiTXDMA.transferSize           = 16;
spi1.spiTXDMA.srcAddressInputMode    = "VARIABLE";
spi1.spiTXDMA.srcBurstStep           = 1;
spi1.spiTXDMA.srcTransferStep        = 1;
spi1.spiTXDMA.srcAddressVariable     = "ili9341_dma_src_address";
spi1.spiTXDMA.burstSize              = 8;
spi1.spiTXDMA.dmaInt.enableInterrupt = true;
spi1.spi.$assign                     = "SPIA";

spi2.$hardware = system.deviceData.board.components.BP_SITE_2.subComponents.SPI;
spi2.$name     = "SD_CARD_SPI";
spi2.bitRate   = 25000000;

sysctl.enable_SYSCTL_PERIPH_CLK_EPWM4     = false;
sysctl.enable_SYSCTL_PERIPH_CLK_EPWM5     = false;
sysctl.enable_SYSCTL_PERIPH_CLK_EPWM6     = false;
sysctl.enable_SYSCTL_PERIPH_CLK_EPWM7     = false;
sysctl.enable_SYSCTL_PERIPH_CLK_EPWM8     = false;
sysctl.enable_SYSCTL_PERIPH_CLK_EQEP1     = false;
sysctl.enable_SYSCTL_PERIPH_CLK_EQEP2     = false;
sysctl.enable_SYSCTL_PERIPH_CLK_CANA      = false;
sysctl.enable_SYSCTL_PERIPH_CLK_CANB      = false;
sysctl.enable_SYSCTL_PERIPH_CLK_PGA1      = false;
sysctl.enable_SYSCTL_PERIPH_CLK_PGA2      = false;
sysctl.enable_SYSCTL_PERIPH_CLK_PGA3      = false;
sysctl.enable_SYSCTL_PERIPH_CLK_PGA4      = false;
sysctl.enable_SYSCTL_PERIPH_CLK_PGA5      = false;
sysctl.enable_SYSCTL_PERIPH_CLK_PGA6      = false;
sysctl.enable_SYSCTL_PERIPH_CLK_PGA7      = false;
sysctl.enable_SYSCTL_PERIPH_CLK_TBCLKSYNC = true;
sysctl.enable_SYSCTL_PERIPH_CLK_CLB1      = false;
sysctl.enable_SYSCTL_PERIPH_CLK_CLB2      = false;
sysctl.enable_SYSCTL_PERIPH_CLK_CLB3      = false;
sysctl.enable_SYSCTL_PERIPH_CLK_CLB4      = false;
sysctl.enable_SYSCTL_PERIPH_CLK_FSITXA    = false;
sysctl.enable_SYSCTL_PERIPH_CLK_LINA      = false;
sysctl.enable_SYSCTL_PERIPH_CLK_FSIRXA    = false;
sysctl.enable_SYSCTL_PERIPH_CLK_PMBUSA    = false;
sysctl.enable_SYSCTL_PERIPH_CLK_DACB      = false;
sysctl.enable_SYSCTL_PERIPH_CLK_DACA      = false;
sysctl.enable_SYSCTL_PERIPH_CLK_CLA1      = false;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
aio1.aioPin.$suggestSolution          = "AIO231";
aio2.aioPin.$suggestSolution          = "AIO241";
aio3.aioPin.$suggestSolution          = "AIO237";
aio4.aioPin.$suggestSolution          = "AIO232";
aio5.aioPin.$suggestSolution          = "AIO230";
aio6.aioPin.$suggestSolution          = "AIO238";
epwm1.epwm.$suggestSolution           = "EPWM1";
epwm1.epwm.epwm_aPin.$suggestSolution = "boosterpack2.80";
epwm1.epwm.epwm_bPin.$suggestSolution = "boosterpack2.79";
epwm2.epwm.$suggestSolution           = "EPWM2";
epwm2.epwm.epwm_aPin.$suggestSolution = "boosterpack2.76";
epwm2.epwm.epwm_bPin.$suggestSolution = "boosterpack2.75";
epwm3.epwm.$suggestSolution           = "EPWM3";
epwm3.epwm.epwm_aPin.$suggestSolution = "boosterpack1.36";
epwm3.epwm.epwm_bPin.$suggestSolution = "boosterpack1.35";
gpio3.gpioPin.$suggestSolution        = "boosterpack1.34";
gpio4.gpioPin.$suggestSolution        = "boosterpack1.32";
gpio5.gpioPin.$suggestSolution        = "boosterpack1.33";
sci1.sci.$suggestSolution             = "SCIA";
sci1.sci.sci_rxPin.$suggestSolution   = "boosterpack2.43";
sci1.sci.sci_txPin.$suggestSolution   = "boosterpack2.44";
sci2.sci.$suggestSolution             = "SCIB";
sci2.sci.sci_rxPin.$suggestSolution   = "boosterpack1.3";
sci2.sci.sci_txPin.$suggestSolution   = "boosterpack1.4";
spi1.spi.spi_simoPin.$suggestSolution = "boosterpack1.15";
spi1.spi.spi_somiPin.$suggestSolution = "boosterpack1.14";
spi1.spi.spi_clkPin.$suggestSolution  = "boosterpack1.7";
spi1.spi.spi_stePin.$suggestSolution  = "boosterpack1.19";
spi2.spi.$suggestSolution             = "SPIB";
spi2.spi.spi_simoPin.$suggestSolution = "boosterpack2.55";
spi2.spi.spi_somiPin.$suggestSolution = "boosterpack2.54";
spi2.spi.spi_clkPin.$suggestSolution  = "boosterpack2.47";
spi2.spi.spi_stePin.$suggestSolution  = "boosterpack2.59";
